// src/data/mockReservations.ts
import { Reservation } from "../types/reservation";

export const mockReservations: Reservation[] = [
  {
    _id: "1",
    title: "مشاوره مالی و مدیریت",
    description: "توضیحات برای این مشاوره",
    includedServices: [
      "تحلیل صورت‌های مالی",
      "مدیریت هزینه و درآمد",
      "بهینه‌سازی مالیاتی",
      "راهنمایی در تنظیم گزارشات مالی",
      "مشاوره برای افزایش سودآوری",
      "آموزش اصول حسابداری",
      "آنالیز و بهبود فرآیندهای مالی",
      "بررسی و پیشنهاد نرم‌افزارهای مالی",
      "مدیریت ریسک مالی",
      "بهینه‌سازی سرمایه‌گذاری",
    ],
    price: 100,
    date: "2025-03-26",
    timeSlot: "13:00-15:00",
  },
  {
    _id: "2",
    title: "مشاوره آموزشی",
    description: "توضیحات برای این مشاوره",
    includedServices: [
      "آموزش کامل اصول حسابداری",
      "کاربرد اکسل در حسابداری",
      "تحلیل و تفسیر صورت‌های مالی",
      "آموزش نرم‌افزارهای حسابداری",
      "پشتیبانی آموزشی",
      "آموزش محاسبه مالیات",
      "تمرین‌های عملی و پروژه محور",
    ],
    price: 150,
    date: "2025-03-27",
    timeSlot: "10:00-12:00",
  },
  {
    _id: "3",
    title: "مشاوره حسابرسی",
    description: "توضیحات برای این مشاوره",
    includedServices: [
      "مشاوره اولیه رایگان",
      "راهنمایی درباره اصول مالی",
      "بررسی وضعیت مالی کلی",
      "معرفی ابزارهای پایه حسابداری",
      "پاسخ به سوالات عمومی مالی",
    ],
    price: 150,
    date: "2025-03-27",
    timeSlot: "10:00-12:00",
  },
];
